In [1]:
import pandas as pd

df1 = pd.read_csv("file1.csv")
df2 = pd.read_csv("file2.csv")

print(df1)
print(df2)

   id     name  age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
   id      city  salary
0   1  New York   70000
1   2    London   80000
2   4    Sydney   90000

##### pd.concat

In [ ]:
pd.concat([df1,df2])
# ðŸ”¹ Row-wise concatenation (default)

   id     name   age      city   salary
0   1    Alice  25.0       NaN      NaN
1   2      Bob  30.0       NaN      NaN
2   3  Charlie  35.0       NaN      NaN
0   1      NaN   NaN  New York  70000.0
1   2      NaN   NaN    London  80000.0
2   4      NaN   NaN    Sydney  90000.0

In [ ]:
pd.concat([df1,df2],axis=1)
# ðŸ”¹ Column-wise concatenation

   id     name  age  id      city  salary
0   1    Alice   25   1  New York   70000
1   2      Bob   30   2    London   80000
2   3  Charlie   35   4    Sydney   90000